In [2]:
import pandas as pd # pandas 모듈 호출
import numpy as np # numpy 모듈 호출
from pandas import Series, DataFrame
list_data = [ 1,2,3,4,5]
list_name = [ "a","b","c","d","e"]
example_obj = Series(data = list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
from pandas import Series, DataFrame
raw_data = { 'first_name': [ 'Jason', 'Molly', 'Tina', 'Jake', 'Amy'] ,
'last_name': [ 'Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'] ,
'age': [ 42, 52, 36, 24, 73] ,
'city': [ 'San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston'] }
df = pd.DataFrame(raw_data, columns = [ 'first_name', 'last_name',
'age', 'city'] )
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston